#!/usr/bin/env python3

# 1.1. - Перевірити умову: "Число A є додатнє"
a=19
a > 0

# 1.2. - Перевірити умову: "Число A парне"
a=18.73
a%2 == 0

# 1.3. - Перевірити умову: "Число A кратне 13"
a=26
a/13 == 2

# 1.4. - Перевірити умову: "Кожне із чисел A та B - парне"
a=16
b=112
(a%2)+(b%2) == 0

# 1.5  - Перевірити умову: "Кожне із чисел A та B мають однакову парність "
a=160
b=320
(a + b) % 16 == 0

# 2. Задано деякий пароль Pass (str). Перевірити чи пароль "сильний" 
# (пароль будемо вважати "сильним", якщо він складається з 8 символів (або більше) та містить символ @ або # )
# Програма повертає True або False"""
pswd = input("Введите пароль")